#include <vcl.h>
#pragma hdrstop

#include "JYEscopeMain.h"
#include "Common.h"

#define  STRICT
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <process.h>
#include <conio.h>
#include <windows.h>


#include "Tserial_event.h"
#include "JYEscopeMain.h"
#include "PortSetup.h"


Tserial_event *serial_port;

U8	TxBuf[TxBufSize]; 
U8	RxBuf[RxBufSize];

//U8	*TxHead, *TxTail;
//U8	*RxHead, *RxTail;

U8	Rbuf[100];
U8	FrameBuf[20000];
//U32	FrameIndex;

//bool	SynFound;
//bool	SynChSent;
//bool	Rxing;
//bool	Txing;

char	CommandBuf[100];

//U32	TxCnt, RxCnt;

//char InsertPoint = 0;
/*
WaveCapture	CaptureBuffers[MaxCaptureBufferNumber];
WaveCapture	*Pool;
WaveCapture	*CQ_Head, *CQ_Tail;
*/

COMM MyComm;


void	RxQueueInit(COMM *comm, U8 *rxqueue, U16 rxqueuesize)
{
 comm->RxQueueStart = rxqueue;
 comm->RxQueueSize = rxqueuesize;
 comm->RxHead = rxqueue;
 comm->RxTail = rxqueue;
}

void	TxQueueInit(COMM *comm, U8 *txqueue, U16 txqueuesize)
{
 comm->TxQueueStart = txqueue;
 comm->TxQueueSize = txqueuesize;
 comm->TxHead = txqueue;
 comm->TxTail = txqueue;
}

// ========================================================
// Insert one character to RxQueue. Returns non-zero if success,
//	otherwise returns 0.
// 
U8	RxQueueAdd(COMM *comm,  U8 *byte)
{
 U8	*ptmp;
 
 // Store the at queue end
 *comm->RxTail = *byte;	

 // Advance pointer
 if((comm->RxTail + 1) >= (comm->RxQueueStart + comm->RxQueueSize)) {
 	// Roll over
 	ptmp = comm->RxQueueStart;
 	}
 else {

	case FID_WriteWaveform:
	case FID_DSOparamOL:
	case FID_DataOL:
	case FID_ReadWaveform:
	case FID_DSO:
	case FID_Diag:
		tmp0 = 1;
		break;

	default:
		break;
	}

 return(tmp0);
}

void	FrameProc(void)
{
 U16 tmp0, tmp1, tmp2, tmp3;
 sSIZE	*ptmp0, *ptmp1, *ptmp2;
 
 char	*strtmp1 = "HH ";	// 3 character string for Hex diaplay mode
 char	HexDigits[17] = {"0123456789ABCDEF"};
 
 // Frame analysis
 switch((U8)FrameBuf[0]) {
	case FID_Confirm:
      	 	SetEvent(ConnectWaitEvent);
     		JYEscope->Memo1->Lines->Append(AnsiString("Device detected"));
		switch(FrameBuf[3]) {
			case 'O': 
				FrontEndType = 'O';
				OnScreen->Model = FrameBuf[4];
	     			JYEscope->Memo1->Lines->Append(AnsiString("Device type: Oscilloscope"));
				switch (OnScreen->Model) {
					case 0x02:
	     					JYEscope->Memo1->Lines->Append(AnsiString("Device model: DSO 082"));
						JYEscope->UnitName->Caption = "DSO082";
						break;
					case 0x03:
	     					JYEscope->Memo1->Lines->Append(AnsiString("Device model: DSO 094"));
						JYEscope->UnitName->Caption = "DSO094";
						// Send parameter
						Command(FID_DSOparam);
						break;
					case 0x04:
	     					JYEscope->Memo1->Lines->Append(AnsiString("Device model: DSO 068"));
						JYEscope->UnitName->Caption = "DSO068";
//						DSO068_Setup();
						break;
					default:
	     					JYEscope->Memo1->Lines->Append(AnsiString("Device model: Unknown"));
						JYEscope->UnitName->Caption = "DSO";
						break;
					}
				
				break;

			case 'G':
				// Signal generator frontend
				FrontEndType = 'G';
	     			JYEscope->Memo1->Lines->Append(AnsiString("Device type: Signal generator"));
				switch (FrameBuf[4]) {
					case 0x01:
	     					JYEscope->Memo1->Lines->Append(AnsiString("Device model: FG 085"));
						JYEscope->UnitName->Caption = "FG085";
						break;
					default:
	     					JYEscope->Memo1->Lines->Append(AnsiString("Device model: Unknown"));
						JYEscope->UnitName->Caption = "F. Gen";
						break;
					}
				break;

			default:
				JYEscope->UnitName->Caption = "N/A";
				break;
			}
		break;

	case FID_DSO:
		// DSO commands (for models other than DSO 094)
		switch(OnScreen->Model) {
			case 0x04:	// DSO 068
				DSO_CmdProc068();
				break;

			default:
				break;
			}
		break;
		
	case FID_WriteReturn:
     		JYEscope->Memo1->Lines->Append(AnsiString("Data write successful"));
		break;
				
	case FID_DSOparam:
//     		JYEscope->Memo1->Lines->Append(AnsiString("Parameter frame received"));
		// Update coupling
		Capturer->SetCpl(Channel_1, FrameBuf[3 + 4]);
		Capturer->SetCpl(Channel_2, FrameBuf[3 + 8]);
		CplRefresh();

//     		JYEscope->Memo1->Lines->Append(IntToStr((U16)FrameBuf[3 + 14] * 256 + (U16)FrameBuf[3 + 13]));
/*			
		tmp0 = (U16)(&jyScope->oscSysMode) - (U16)(&jyScope->oscTimebase) + 1; 
		ptmp0 = FrameBuf + 3;
		ptmp1 = (U8 *)&jyScope->oscTimebase;
		tmp1 = 0;
		while(tmp1 < tmp0) {
			*ptmp1++ = *ptmp0++;
			tmp1++;
			}
		VSenRefresh();
		TBRefresh();
*/		
		break;

 // DSO094 parameter structure:
/*
typedef	struct 	{
	U8	TimeBase;	// 00
	S16	HPos;		// 01
	U8	Ch1Vsen;	// 03
	U8	Ch1Cpl;		// 04
	S16	Ch1Vpos;	// 05
	U8	Ch2Vsen;	// 07
	U8	Ch2Cpl;		// 08
	S16	Ch2Vpos;	// 09
	U8	TrigMode;	// 11
	U8	TrigEdge;		// 12
	S16	TrigLvl;		// 13
	U8	TrigSrc;		// 15
	S8	TrigPos;		// 16
	U8	TrigSen;		// 17
	S16	RecLen;		// 18
	U8	Baudrate;	// 20
	U8	ChnCfg;		// 21
	S8	Ref1;		// 22
	S8	Ref2;		// 23
	U8	SysMode;	// 24	
	U8	Status;		// 25
	} DSO;
*/
	case FID_DSOparamOL:
		// Offline DSO parameter frame received
		// Save parameters to object 'Capturer' if it is created
		Capturer->SetTimeBase(FrameBuf[3 + 0] + 2);		; // 2 is the TB seting offset between jyeLab and DSO094
		Capturer->SetHPos(3 * (*(S16 *)(&FrameBuf[3 + 1])));
		Capturer->SetVSen(Channel_1, FrameBuf[3 + 3]);
		Capturer->SetCpl(Channel_1, FrameBuf[3 + 4]);
//		Capturer->SetVPos(Channel_1, *(S16 *)(&FrameBuf[3 + 5]));
		Capturer->SetVSen(Channel_2, FrameBuf[3 + 7]);
		Capturer->SetCpl(Channel_2, FrameBuf[3 + 8]);
//		Capturer->SetVPos(Channel_2, *(S16 *)(&FrameBuf[3 + 10]));
		Capturer->SetTrigMode(FrameBuf[3 + 11] - 1);
		Capturer->SetTrigSlope(FrameBuf[3 + 12] - 1);
		Capturer->SetTrigLvl(3 * (*(S16 *)(&FrameBuf[3 + 13])));
		Capturer->SetTrigSrc(FrameBuf[3 + 15] - 1);
		Capturer->SetTrigPos(FrameBuf[3 + 16]);
		Capturer->SetRecLen(3 * (*(U16 *)(&FrameBuf[3 + 18])));	
		Capturer->SetRef(Channel_1, 3 * FrameBuf[3 + 22]);
